# 'Создайте функцию которая принимает список как аргумент
# numbers и возвращает наибольшее число в списке
# Создайте функцию которая принимает список как аргумент
# numbers и возвращает наименьшее число в списке
# список numbers должен содержать только отрицательные числ'
def more(list):
    numbers = 0
    for z in list:
        if numbers < z:
            numbers = z
    return numbers
print(more([1,234,123]))

def fgf():


